app/controllers/cases_controller.rb

  def index
    @cases = Case.all
---
SELECT "cases".* FROM "cases"

  def create
    @case = Case.new(case_params)

    # respond_to do |format|
      if @case.save
---
INSERT INTO "cases" ("response", "created_at", "updated_at") VALUES (?, ?, ?)  [["response", "ppp"], ["created_at", "2015-04-21 15:23:34.451099"], ["updated_at", "2015-04-21 15:23:34.451099"]]

    def set_case
      @case = Case.find(params[:id])
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 0]]