app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "yess"], ["created_at", "2015-04-21 13:48:57.262052"], ["updated_at", "2015-04-21 13:48:57.262052"]]